Repository: netzob/netzob
Catalog: resources/static/netzob/locales/*/LC_MESSAGES/netzob.po
Languages: fr

source: Symbol's name:
fr: Nom du symbole :

source: Export project
fr: Exporter le projet

source: Select a directory
fr: Sélectionnez un répertoire

source: XML Output filename
fr: Fichier de sortie XML

source: Import a project
fr: Importer un projet

source: Project to import:
fr: Projet à importer :

source: New project
fr: Nouveau projet

source: Project's name:
fr: Nom du projet :

source: Rename the layer X
fr: Renommer la couche protocolaire

source: Select the new workspace to switch on
fr: Sélectionnez le nouvel espace de travail sur lequel basculer

source: Select a folder
fr: Sélectioner un répertoire

source: New Project
fr: Nouveau projet

source: Create a new project
fr: Créer un nouveau projet

source: Save Project
fr: Enregistrer le projet

source: Save the current project
fr: Enregistrer le projet courant

source: Import Project
fr: Importer un projet

source: Export Project
fr: Exporter le projet

source: Save current project
fr: Enregistrer le projet courant

source: Switch Workspace
fr: Changer d'espace de travail

source: Choose a new working directory
fr: Sélectionner un nouveau répertoire de travail

source: Quit
fr: Quitter

source: About Netzob
fr: À propos de Netzob

source: File
fr: Fichier

source: View
fr: Vue

source: Help
fr: Aide

source: Open Project From Workspace
fr: Ouvrir un projet de l'espace de travail

source: Open a project already into the workspace
fr: Ouvrir un projet déjà présent dans le répertoire de travail

source: Netzob - inference communication protocol
fr: Netzob - Inférence de protocole de communication

source: Switch perspective
fr: Changer de vue

source: Learnable
fr: Mémorisable

source: Variable Type
fr: Type de la variable

source: Value
fr: Valeur

source: Pointed ID
fr: ID pointé

source: has a size
fr: possède une taille

source: Delimiter (hex)
fr: Délimiteur (hex)

source: Choose the future position of this variable among this node.
fr: Sélectionnez la future position de cette variable au sein du nœud.

source: Variable position
fr: Position de la variable

source: Create default variable
fr: Créer une variable par défaut

source: Import file
fr: Import de fichier

source: Import messages
fr: Importer les messages

source: Select all
fr: Sélectionner tout

source: Unselect all
fr: Désélectionner tout

source: Invert selection
fr: Inverser la sélection

source: Displayed Packets:
fr: Paquets affichés :

source: Selected Packets:
fr: Paquets sélectionnés :

source: Import messages in project
fr: Import de messages dans le projet

source: Name of created symbol
fr: Nom du symbole crée

source: Remove duplicated messages (payload)
fr: Supprimer les messages en doublon

source: Keep properties of duplicated messages
fr: Conserver les propriétés des messages dupliqués

source: Confirm the deletion of state
fr: Confirmer la suppression d'un état

source: Confirm the deletion of the transition
fr: Confirmer la suppression de la transition

source: Describe the Close Channel
fr: Décrire le transition de fermeture de canal

source: Time before closing (ms)
fr: Durée avant fermeture (ms)

source: Start state
fr: État de démarrage

source: End state
fr: État terminal

source: Describe the Open Channel
fr: Décrire la transition d'ouverture de canal

source: Time before opening (ms)
fr: Temps avant ouverture (ms)

source: Max Number of Attempt
fr: Nombre maximum de tentatives

source: Create a SemiStochastic Transition
fr: Créer une transition semi-stochastique

source: Describe the transition
fr: Description de la transition

source: Start State
fr: État de démarrage

source: End State
fr: État final

source: Input Symbol
fr: Symbole d'entrée

source: Output Symbol
fr: Symbole de sortie

source: Probability (%)
fr: Probabilité (%)

source: Time (ms)
fr: Durée (ms)

source: Remove Output Symbol
fr: Supprimer le symbole de sortie

source: Add Output Symbol
fr: Ajouter un symbole de sortie

source: Symbol
fr: Symbole

source: Probability
fr: Probabilité

source: Time
fr: Durée

source: Describe the State to Create
fr: Décrire l'état à créer

source: Initial State
fr: État de démarrage

source: Confirm the deletion of transition
fr: Confirmer la suppression de la transition

source: Active Grammar Inferring
fr: Inférence active de grammaire

source: Infer the grammar
fr: Inférer la grammaire

source: Passive Grammar Inferring
fr: Inférence passive de grammaire

source: Infer the grammar based on provided examples
fr: Inférer la grammaire en utilisant des exemples de communications

source: Create State
fr: Créer un état

source: Create a state in the current grammar
fr: Créer un état dans la grammaire courante

source: Create Semi-Stochastic Transiton
fr: Créer une transition semi-stochastique

source: Create a semi stochastic transition
fr: Créer une transition semi-stochastique

source: Grammar Edition
fr: Edition de la grammaire

source: Create OpenChannel Transition
fr: Créer une transition d'ouverture de canal

source: Create Open Channel Transition
fr: Créer une transition d'ouverture de canal

source: Create CloseChannel Transition
fr: Créer une transition de fermeture de canal

source: Create a Close Channel Transition
fr: Créer une transition de fermeture de canal

source: Warning message
fr: Message d'avertissement

source: Displayed packets:
fr: Paquets affichés :

source: Selected packets:
fr: Paquets sélectionnés :

source: Selected files:
fr: Fichiers sélectionnés :

source: Import as:
fr: Importer comme :

source: Create Network Actor
fr: Créer un acteur réseau

source: Create a Network Actor
fr: Créer un acteur réseau

source: General Informations
fr: Informations générales

source: Initiator
fr: Initiateur

source: Network Conf
fr: Configuration réseau

source: Predefined Values
fr: Valeurs prédéfinies

source: Create a network actor
fr: Créer un acteur réseau

source: Actors
fr: Acteurs

source: Status
fr: Statut

source: Property
fr: Propriété

source: Grammar
fr: Grammaire

source: Communication Channel
fr: Canal de communication

source: Info :
fr: Information :

source: Status :
fr: Statut :

source: Memory Accesses
fr: Accès à la mémoire

source: Create a Custom Transformation Function
fr: Créer une fonction de transformation personnalisée

source: Custom Transformation Function
fr: Fonction de transformation personnalisée

source: Name of the function
fr: Nom de la fonction

source: Source code is bi-directionnal
fr: La fonction doit être bidirectionnelle

source: Test your function
fr: Tester la fonction

source: Filtered
fr: Filtré

source: Edit field
fr: Éditer le champ

source: Field name
fr: Nom du champs

source: Regex (be careful!)
fr: Expression rationnelle (faire attention !)

source: Search For Environmental Dependencies
fr: Rechercher les dépendances d'environnement

source: Search for Environmental Dependencies
fr: Rechercher les dépendances d'environnement

source: The following Environmental Dependencies will be searched
fr: Les dépendances d'environnement suivantes seront cherchées

source: Field analysis
fr: Analyse du champs

source: Field name:
fr: Nom du champ :

source: Domain of definition
fr: Domaine de définition

source: Domain
fr: Domaine

source: Type guessing
fr: Identification du type

source: column
fr: Colonne

source: Filter:
fr: Filtre :

source: Distribution of bytes values
fr: Distribution des valeurs d'octets

source: Empty Message Table
fr: Table de messages vide

source: Close the view
fr: Fermer la vue

source: The message is not valid according to symbol target's regex
fr: Le message n'est pas valide vis-à-vis de l'expression rationnelle du symbole cible

source: What do you want to do ?
fr: Que voulez-vous faire ?

source: The target symbol's regex doesn't apply to the selected message. Below is the available solution you have to resolve this issue.
fr: L'expression rationnelle du symbole cible ne s'applique pas au message sélectionné. Veuillez choisir une des solutions proposées.

source: Move selected message and forget target message format.
fr: Déplacer le message sélectionné et oublier format de message cible.

source: Move selected message and re-compute the regex
fr: Déplacer le message sélectionné et recalculer l'expression régulière

source: Move selected message to trash
fr: Déplacer les messages sélectionnés vers la corbeille

source: Split field
fr: Fractionner le champ

source: Change alignment
fr: Changer l'alignement

source: Variables table
fr: Table des variables

source: Regex
fr: Expression rationnelle

source: Additional information
fr: Informations additionnelles

source: Simple Partitioning
fr: Partitionnement simple

source: Use simple partioning on selected symbol
fr: Utiliser le partitionnement simple sur le symbole sélectionné

source: Smooth Partitioning
fr: Partitionnement lissé

source: Use smooth partioning on selected symbol
fr: Utilisez partitionnement lissé sur le symbole sélectionné

source: Reset Partitioning
fr: Réinitialiser partitionnement

source: Reset partitioning of selected symbol
fr: Réinitialiser le partitionnement du symbole sélectionné

source: Concatenate Fields
fr: Concaténer les champs

source: Concatenate selected fields
fr: Concaténer les champs sélectionnés

source: Split Field
fr: Fractionner le champ

source: Split selected field
fr: Fractionner les champs sélectionnés

source: Edit the variable for selected field
fr: Modifier la variable du champs sélectionné

source: Move To Another Symbol
fr: Déplacer vers un autre symbole

source: Move selected messages to another symbol
fr: Déplacer les messages sélectionnés vers un autre symbole

source: Delete Message(s)
fr: Supprimer les messages

source: Delete selected message(s)
fr: Supprimer les messages sélectionnés

source: Environmental Dependencies
fr: Dépendances d'environnement

source: Search for environmental dependencies for all messages
fr: Chercher les dépendances d'environnement pour tous les messages

source: Messages Distribution
fr: Distribution des messages

source: Display messages distributions for selected symbol(s)
fr: Afficher la répartition des messages pour les symboles sélectionnés

source: Variable Table
fr: Table des variables

source: Display variable table
fr: Afficher la table des variables

source: Compute Field Limits
fr: Calculer les limites des champs

source: Compute min and max size of selected symbol(s)
fr: Calculer les tailles minimum et maximum des champs pour les symboles sélectionnés

source: Import Messages From File
fr: Importer des messages depuis un fichier

source: Import messages from file
fr: Importer des messages depuis un fichier

source: Capture Messages
fr: Capturer des messages

source: Capture messages
fr: Capturer des messages

source: Automatic Tools
fr: Outils automatiques

source: Manual Tools
fr: Outils manuels

source: Force partitioning
fr: Forcer le partitionnement

source: Use force partitioning on selected symbol
fr: Utiliser le partitionnement forcé sur le symbole sélectionné

source: Sequence alignment
fr: Alignement de séquence

source: Use sequence alignment on selected symbol
fr: Appliquer l'alignement de séquence sur le symbole sélectionné

source: Search text
fr: Chercher un texte

source: Search a string in all messages of the current symbol
fr: Rechercher un motif dans tous les messages du symbole courant

source: Filter Displayed Messages
fr: Filtrer les messages affichés

source: Filter displayed messages in all messages of current symbol
fr: Filtrer les messages du symbole courant

source: Sequence alignment on selected symbol
fr: Alignement de séquence sur le symbole sélectionné

source: Force Partitioning on selected symbol
fr: Partitionnement forcé sur le symbole sélectionné

source: Force Partitioning
fr: Forcer le partitionnement

source: Simple Partitioning on selected symbol
fr: Partitionnement simple sur le symbole sélectionné

source: Smooth Partitioning on selected symbol
fr: Partitionnement lissé sur le symbole sélectionné

source: Reset Partitioning on selected symbol
fr: Réinitialiser le partitionnement du symbole sélectionné

source: Field
fr: Champ

source: Select all symbols
fr: Sélectionner tous les symboles

source: Unselect all symbols
fr: Désélectionner tous les symboles

source: Add a new empty symbol
fr: Ajouter un nouveau symbole vide

source: New
fr: Nouveau

source: Concatenate selected symbols
fr: Concaténer les symboles sélectionnés

source: Concatenate
fr: Concaténer

source: Delete selected symbol(s)
fr: Supprimer les symboles sélectionnés

source: New empty view for message of symbol
fr: Ajouter une nouvelle vue pour afficher des messages

source: New MessageList
fr: Nouvelle liste de messages

source: Properties
fr: Propriétés

source: Project
fr: Projet

source: Delimiter:
fr: Délimiteur :

source: Delimiter format:
fr: Format du délimiteur :

source: Hexadecimal
fr: Hexadécimal

source: Stri
fr: Chaine de caractères

source: Reset partitioning
fr: Annuler le partitionnement

source: Similarity percent:
fr: Seuil de similarité :

source: Unit size:
fr: Taille de l'unité :

source: Orphan reduction
fr: Réduction des messages orphelins

source: Smooth alignement
fr: Lisser l'alignement

source: Building the initial matrix
fr: Construction de la matrice initiale

source: Reducing the matrix
fr: Réduction de la matrice

source: Align obtained clusters
fr: Alignement de séquence dans chaque groupe

source: Execute Orphan Reductions
fr: Réduction des messages orphelins

source: Clean empty fields
fr: Nettoyez les champs vides

source: Simple partitioning
fr: Partitionnement simple

source: Smooth partitioning
fr: Lisser le partitionnement

source: Search:
fr: Chercher :

source: Find previous
fr: Résultat précédent

source: Find next
fr: Résultat suivant

source: Search properties
fr: Propriétés de la recherche

source: Search in
fr: Rechercher

source: Focused symbol
fr: Symbole ayant le focus

source: Displayed symbols
fr: Symboles affichés

source: All symbols
fr: Tous les symboles

source: Use inverted search:
fr: Recherche inversée :

source: Underline found objects:
fr: Souligner les résultats :

source: Match case:
fr: Sensible à la casse :

source: Use regular expression:
fr: Activer les expressions régulières :

source: yes
fr: oui

source: no
fr: non

source: Separator:
fr: Séparateur :

source: Update process list
fr: Mettre à jour la liste des processus

source: Process:
fr: Processus :

source: Filter flows:
fr: Filtrer les flux :

source: File system (FS)
fr: Système de fichiers (FS)

source: Network
fr: Réseau

source: Update flow list
fr: Mettre à jour les flux

source: All flows
fr: Tous les flux

source: FS flows
fr: Flux de type FS

source: Network flows
fr: Flux réseau

source: IPC flows
fr: Flux de type IPC

source: Selected flows
fr: Flux sélectionnés

source: Device:
fr: Interface :

source: BPF Filter:
fr: Filtre BPF :

source: Import layer:
fr: Importer la couche :

source: Raw
fr: Données brutes

source: Layer 2 (Ethernet/Linux SLL)
fr: Couche 2 (Ethernet/Linux SLL)

source: Layer 3 (IPv4)
fr: Couche 3 (IPv4)

source: Layer 4 (UDP/TCP)
fr: Couche 4 (UDP/TCP)

source: Count limit:
fr: Quantité :

source: Time limit:
fr: Durée de capture :
