Repository: netzob/netzob
Catalog: resources/static/netzob/locales/*/LC_MESSAGES/netzob.po
Languages: fr

source: A project with this name exists
fr: Un projet avec ce nom existe déjà

source: No project selected.
fr: Aucun projet sélectionné.

source: No file selected
fr: Aucun fichier sélectionné

source: The file doesn't define a valid project.
fr: Le fichier ne contient pas de projet valide.

source: Copy of {0}
fr: Copie de {0}

source: An error occurred while copying the file
fr: Une erreur est survenue durant la copie du fichier

source: Please open a project before exporting it.
fr: Veuillez ouvrir un projet avant de l'exporter.

source: No directory selected
fr: Aucun répertoire sélectionné

source: No filename provided
fr: Aucun nom de fichier fourni

source: An error occurred while exporting the project.
fr: Une erreur est survenue durant l'export du projet.

source: An error occurred while loading workspace.
fr: Une erreur est survenue pendant le chargement de l'espace de travail.

source: An error occurred while creating workspace.
fr: Une erreur est survenue durant la création de l'espace de travail.

source: Vocabulary Inference
fr: Inférence de vocabulaire

source: Grammar Inference
fr: Inférence de grammaire

source: Simulator
fr: Simulateur

source: Human readable
fr: Lisible

source: Save the changes to the project "{0}" before closing?
fr: Voulez-vous sauvegarder les modifications du projet "{0}" avant la fermeture ?

source: If you don't save, changes will be permanently lost.
fr: Vos modifications seront définitivement perdues si vous ne sauvegardez pas.

source: Close _Without Saving
fr: Fermer sans sauvegarder

source: Name
fr: Nom

source: New Workspace
fr: Nouvel espace de travail

source: Unable to find plugins static resources.
fr: Impossible de trouver l'emplacement des ressources statiques.

source: Current workspace: {0}
fr: Espace de travail courant : {0}

source: Current workspace: NO WORKSPACE COMPUTED!
fr: Espace de travail courant : aucun espace de travail crée !

source: Base64 Function
fr: Fonction Base64

source: GZip Function
fr: Fonction GZip

source: BZ2 Function
fr: Fonction BZ2

source: The workspace's path ({0}) is incorrect.
fr: L'emplacement de l'espace de travail ({0}) est incorrect.

source: The workspace's configuration file can't be find (No workspace path given).
fr: La configuration de l'espace de travail n'a pas été trouvée (l'emplacement de l'espace de travail n'a pas été fourni).

source: The specified workspace's configuration file ({0}) is not valid: its not a file.
fr: L'espace de travail spécifié dans le fichier de configuration ({0}) n'est pas valide : il ne s'agit pas d'un fichier.

source: The specified workspace's configuration file ({0}) is not readable.
fr: Le fichier de configuration de l'espace de travail indiqué ({0}) n'est pas lisible.

source: The specified workspace is not valid according the XSD definitions.
fr: L'espace de travail indiqué n'est pas conforme aux définitions XSD.

source: Import from File
fr: Importer depuis un fichier

source: [Aggregate] {0} ({1})
fr: [Agrégat] {0} ({1})

source: [Alternate] {0} ({1})
fr: [Alternat] {0} ({1})

source: Message ID: {0} not found in importer message list
fr: ID de message ({0}) non trouvé dans la liste d'import des messages

source: Update processes list
fr: Mettre à jour la liste des processus

source: Path
fr: Emplacement

source: Create prototype
fr: Créer un prototype

source: Delete prototype
fr: Supprimer le prototype

source: Start capture
fr: Démarrer la capture

source: Stop capture
fr: Arreter la capture

source: Function
fr: Fonction

source: Parameter
fr: Paramètre

source: Data
fr: Données

source: Import data from third parties
fr: Importer des données provenant de tiers

source: Select data source
fr: Sélectionner la source de donnée

source: Select a third party
fr: Sélectionnez un tiers

source: Load
fr: Chargement

source: Message ID
fr: ID de message

source: Import
fr: Importer

source: Check if this trace is a session
fr: Vérifier si cette trace est une session

source: Select one or multiple file
fr: Sélectionnez un ou plusieurs fichiers

source: Select file(s)
fr: Sélectionner les fichier(s)

source: Content
fr: Contenu

source: Are you sure to import the {0} computed messages in project {1}?
fr: Êtes-vous sur d'importer les {0} paquets sélectionnés dans le projet {1} ?

source: Processes
fr: Processus

source: Automatic abstraction of the current grammar
fr: Abstraction automatique de la grammaire courante

source: Start the abstraction
fr: Créer une abstraction

source: Configuration of the automatic inference
fr: Configuration de l'inférence automatique

source: Target:
fr: Cible :

source: SERVER
fr: SERVEUR

source: Protocol:
fr: Protocole :

source: Our port:
fr: Notre port :

source: Target Port:
fr: Port cible :

source: Maximum number of states:
fr: Nombre maximum d'états :

source: Reseting script:
fr: Script de remise à zéro :

source: Start inference
fr: Démarrer l'inférence

source: Execution of the inferring process
fr: Lancement du processus d'inférence

source: Membership queries
fr: Requètes d'appartenances

source: Responses
fr: Réponses

source: Save as Grammar
fr: Sauvegarder la grammaire

source: Search
fr: Rechercher

source: Search results
fr: Résultats de la recherche

source: Creation of a variable
fr: Création d'une variable

source: Description of the variable
fr: Description de la variable

source: Create
fr: Créer

source: Word
fr: Mot

source: Decimal Word
fr: Mot hexadécimal

source: IPv4 Word
fr: Mot IPv4

source: MAC Word
fr: MAC hexadécimal

source: Hexadecimal Word
fr: Mot hexadécimal

source: Binary
fr: Binaire

source: Integer
fr: Entier

source: Aggregate
fr: Agréger

source: Referenced Variable
fr: Variable référencée

source: Repeat Variable
fr: Variable de répétition

source: Add a sub-element
fr: Ajouter un sous-élément

source: Definition of the Binary Variable
fr: Définition de la variable binaire

source: Parent ID:
fr: ID du parent :

source: Original value:
fr: Valeur initiale :

source: Constraints when parsing / generating
fr: Contraintes lors de l'analyse / génération

source: Minimum number of bits:
fr: Nombre minimum de bits :

source: Maximum number of bits:
fr: Nombre maximum de bits :

source: Definition of the Hexadecimal Variable
fr: Définition de la variable héxadécimale

source: Minimum number of hex (0xf=1):
fr: Nombre minimum de caractères héxa (0xf=1) :

source: Maximum number of hex:
fr: Nombre maximum de caractères héxa :

source: Definition of the Alternative
fr: Définition de l'alternative

source: Name:
fr: Nom :

source: Alternate
fr: Alterner

source: Definition of the Aggregate
fr: Définition de l'agrégat

source: Definition of the WORD
fr: Définition du mot

source: Value:
fr: Valeur :

source: Definition of the Decimal WORD
fr: Définition du mot héxadécimal

source: Definition of the IPv4 Variable
fr: Définition de la variable IPv4

source: Start:
fr: Démarrage :

source: End:
fr: Fin :

source: Representation
fr: Représentation

source: Definition of the ReferencedVariable
fr: Définition de la variable référencée

source: Referenced Variable:
fr: Variable référencée :

source: Select Workspace
fr: Sélectionner l'espace de travail

source: Select a workspace
fr: Sélectionner un espace de travail

source: Netzob stores your projects in a folder called a workspace.
fr: Netzob stocke vos projets dans un dossier appelé un espace de travail.

source: Choose a workspace folder to use.
fr: Choisissez un répertoire à utiliser comme espace de travail.

source: Workspace:
fr: Espace de travail :

source: Browse
fr: Parcourir

source: Select the workspace
fr: Sélectionner l'espace de travail

source: Netzob is released under the terms of the {0} license. {1}
fr: Netzob est distribué sous les termes de la licence {0}. {1}

source: Impossible to contact the remote server.
fr: Impossible de contacter le serveur distant.

source: Please verify your API key.
fr: Merci de vérifier votre clé d'API.

source: Close
fr: Fermer

source: You've been associated to the bug report {0}/issues/{1}.
fr: Vous avez été associé au rapport {0}/issues/{1}.

source: An error occurred while you were associated with the bug report {0}/issues/{1}.
fr: Une erreur s'est produite lors de l'association au rapport {0}/issues/{1}.

source: The bug report has successfully been published on {0}/issues/{1}
fr: Le rapport a été publié avec succès sur {0}/issues/{1}

source: The server's certificate won't be verified.
fr: Le certificat du serveur ne sera pas vérifié.

source: Verify below the transformed messages
fr: Vérifiez ci-dessous les messages transformées

source: Specify the name and the source code of your Function
fr: Spécifiez le nom et le code source de votre fonction

source: Select a symbol to see its XML definition
fr: Sélectionner un symbole pour voir sa définition XML

source: No XML definition found
fr: Aucune définition XML trouvée

source: Select a symbol to see its text definition
fr: Sélectionner un symbol pour voir sa définition textuelle

source: No scapy definition found
fr: Aucune définition scapy trouvé

source: No text definition found
fr: Aucune définition trouvée

source: Export project as raw XML
fr: Exporter le projet au format XML brut

source: Symbols
fr: Symboles

source: Export project as text
fr: Exporter le projet au format texte

source: Give a name to the transition
fr: Donnez un nom à la nouvelle transition

source: Give a valid time (> 0ms)
fr: Donnez une durée valide (> 0 ms)

source: Select a start state.
fr: Sélectionnez un état initial.

source: Select an end state
fr: Sélectionnez un état final

source: An error occurred and prevented to retrieve the provided start state.
fr: Une erreur s'est produite et a empêché de retrouver l'état initial fourni.

source: An error occurred and prevented to retrieve the provided end state.
fr: Une erreur s'est produite et a empêché de récupérer l'état final prévu.

source: Provided start state already has a close channel transition.
fr: L'état de départ fourni a déjà une transition de fermeture de canal.

source: Give a valid maximum number of attempt (> 1)
fr: Donnez un nombre maximal de tentatives valide (> 1)

source: Provided start state already has an open channel transition.
fr: L'état de départ fourni a déjà une transition d'ouverture de canal.

source: Give a name to the transition.
fr: Donnez un nom à la nouvelle transition.

source: Select an input Symbol.
fr: Sélectionnez un symbole d'entrée.

source: An error occurred and prevented to retrieve the provided input symbol
fr: Une erreur s'est produite et a empêché de récupérer le symbole d'entrée fourni

source: The specified start state already has a transition with the same input symbol.
fr: L'état de départ fourni a déjà une transition avec le même symbole d'entrée.

source: Provide at least 1 output symbol (even an EmptySymbol).
fr: Fournissez au moins un symbole de sortie (même un symbole vide).

source: An error occurred and prevented to retrieve the output symbols
fr: Une erreur s'est produite et a empêché de récupérer les symboles de sortie

source: Select an output Symbol before adding it.
fr: Sélectionnez un symbole de sortie avant de l'ajouter.

source: An error occured and prevented to retrieved the output symbol.
fr: Une erreur est survenue et a empêché de récupérer le symbole de sortie.

source: Specify a valid probability defined over 100 (float)
fr: Spécifiez une probabilité valide définie sur 100 (flottant)

source: Specify a valid probability (0.0<=probability<=100.0)
fr: Spécifiez une probabilité valide (0,0 <= probabilité <= 100,0)

source: Specify a valid time defined in millisecond (int)
fr: Spécifiez une heure valide définie en millisecondes (entier)

source: Specify a valid time (0<=time)
fr: Spécifiez une durée valide (0 <= durée)

source: You cannot add multiple time the same output symbol.
fr: Vous ne pouvez pas ajouter de durée multiples au même symbole de sortie.

source: The sum of probabilities is above 100, please adapt the provided value.
fr: Spécifiez des probabilités dont la somme est valide (0,0 <= probabilité <= 100,0).

source: Select an output Symbol before removing it.
fr: Sélectionnez un symbole de sortie avant de le supprimer.

source: The first created state must be an initial state
fr: Le premier état créé doit être un état initial

source: A state already has this name, please specify another one
fr: Ce nom d'état existe déjà. Choisissez un autre nom.

source: You cannot deactivate an initial state.
fr: Vous ne pouvez pas désactiver un état initial.

source: Edit the state
fr: Editer l'état

source: Edit State
fr: Edtiter l'état

source: Delete State
fr: Supprimez un état

source: Edit
fr: Éditer

source: Delete
fr: Effacer

source: Specify the name of new symbol
fr: Choisissez un nom pour le nouveau symbole

source: The provided symbol name already exists.
fr: Ce nom de symbole existe déjà.

source: {0} messages will be imported
fr: {0} messages vont être importés

source: Give a name to the actor
fr: Choisissez un nom pour le nouvel acteur

source: An actor already has this name.
fr: Un acteur à déjà ce nom.

source: Specify the type of the actor.
fr: Spécifiez un type d'acteur.

source: Only UDP and TCP layer 4 protocols are supported.
fr: Seuls les protocoles de niveau 4 UDP et TCP sont supportés.

source: Specify a valid bind port (int>0)
fr: Spécifiez un port valide (int>0)

source: Specify a valid target port (int>0)
fr: Spécifier un port destination valide (int>0)

source: A network client requires a target IP.
fr: Un client réseau nécessite une adresse IP.

source: A network client requires a target port.
fr: Un client réseau nécessite un port destination.

source: A network server requires a bind IP.
fr: Un serveur réseau nécessite une adresse IP.

source: A network server requires a bind port.
fr: Un serveur réseau nécessite un port réseau.

source: Click yes to confirm the deletion of the selected actor
fr: Cliquez sur oui pour valider la suppression de l'acteur sélectionné

source: Size Fields Identifications
fr: Identification des champs taille

source: Cancel
fr: Annuler

source: Start
fr: Démarrer

source: size field
fr: taille du champ

source: start of payload
fr: Début de la charge utile

source: No occurrence found.
fr: Aucune occurrence trouvée.

source: {0} occurrence found.
fr: {0} occurrence trouvée.

source: Can't split field with empty cell(s).
fr: Ne peux pas découper un champs sans cellule.

source: Edit the sub-element
fr: Éditer le sous-élément

source: Edit this element
fr: Éditer cet élément

source: Move this element
fr: Déplacer cet élément

source: Remove this element
fr: Supprimer cet élément

source: Click yes to confirm the removal of the variable {0}
fr: Cliquez sur oui pour confirmer la suppression de la variable {0}

source: Click yes to confirm the edition of the variable {0}
fr: Cliquez sur oui pour confirmer l'édition de la variable {0}

source: Select this element
fr: Sélectionner cet élément

source: No layer selected.
fr: Aucune couche sélectionnée.

source: No symbol selected.
fr: Aucun symbole sélectionné.

source: No selected symbol.
fr: Aucun symbole sélectionné.

source: You need to select at least two fields.
fr: Vous devez sélectionner au moins deux champs.

source: No selected field.
fr: Aucun champs sélectionné.

source: No selected message.
fr: Aucun message sélectionné.

source: Click yes to confirm the deletion of the selected message
fr: Cliquez sur oui pour confirmer la suppression du message sélectionné

source: Fields limits computed.
fr: Limites des champs calculées.

source: No importer plugin available.
fr: Aucun plugin d'import disponible.

source: Selected field range overlaps existing layer.
fr: La plage de champs sélectionnée chevauche une couche protocolaire.

source: Layer creation
fr: Création d'une couche protocolaire

source: Rename the layer {0}
fr: Renommer la couche {0}

source: Force partitioning field {0}
fr: Partitionnement forcé du champ {0}

source: Force partitioning finished!
fr: Partitionnement forcé terminé !

source: Reset field {0}
fr: Réinitialiser le champ {0}

source: Reset finished!
fr: Réinitialisation terminé !

source: Simple partitioning field {0}
fr: Partitionnement simple du champ {0}

source: Smooth field {0}
fr: Lisser le champ {0}

source: Smooth finished!
fr: Lissage terminé !

source: Edit Field
fr: Éditer le champ

source: Field Visualization
fr: Visualisation du champ

source: Configure Transformation Functions
fr: Configurer les fonctions de transformation

source: Create Layer
fr: Créer une couche

source: Edit Variable
fr: Éditer la variable

source: Field Analysis
fr: Analyse du champs

source: Extract Fields To A New Symbol
fr: Extraire les champs dans un nouveau symbole

source: Delete Message
fr: Supprimer le message

source: Copy To Clipboard
fr: Copier dans le presse papier

source: UnitSize
fr: Taille unitaire

source: Sign
fr: Signe

source: Endianess
fr: Boutisme

source: Raw Message
fr: Message brut

source: Aligned Raw Message
fr: Message brut aligné

source: Aligned Formatted Message
fr: Message brut aligné

source: Raw Field
fr: Champ brut

source: Formatted Field
fr: Champ formaté

source: Edit Layer
fr: Éditer la couche

source: Partitioning
fr: Partitionner

source: Visualization
fr: Visualisation

source: Transformation Functions
fr: Fonctions de transformation

source: Delete Layer
fr: Supprimer la couche

source: Create Your Function
fr: Créer une nouvelle fonction

source: Sequence Alignment
fr: Alignement de séquences

source: Force Partitionment
fr: Partitionnement forcé

source: Simple Partitionment
fr: Partitionnement simple

source: Smooth Partitionment
fr: Partitionnement lissé

source: Reset Partitionment
fr: Annuler le partitionnement

source: Provide the possibility to capture IPC traffic.
fr: Offre la possibilité de capturer un trafic IPC.

source: Capture IPC traffic
fr: Capturer un trafic IPC

source: Capture IPC messages
fr: Capturer les messages IPC

source: This device cannot be sniffed since the layer 2 is not supported ({0})
fr: Cette interface ne peut être utilisée car la couche 2 n'est pas supportée ({0})

source: Cannot import one of the provided packets since its layer 3 is unsupported (Only IP is currently supported, packet ethernet type = {0})
fr: Ne peut importer ce paquet réseau car la couche 3 ({0}) n'est pas supportée (seul le protocole IP est pour l'instant supporté)

source: Incorrect device
fr: Interface incorrecte

source: Incorrect count
fr: Valeur du compteur incorrecte

source: Incorrect time
fr: Valeur du temporisateur incorrecte

source: Provide the possibility to capture network traffic.
fr: Offre la possibilité de capturer le trafic réseau.

source: Capture network traffic
fr: Capturer le trafic réseau

source: Capture network messages
fr: Capturer les messages réseau

source: Payload
fr: Charge utile

source: Source Address
fr: Adresse source

source: Destination Address
fr: Adresse destination

source: Source IP
fr: IP source

source: Destination IP
fr: IP destination

source: Protocol
fr: Protocole

source: Source Port
fr: Port source

source: Destination Port
fr: Port destination

source: Entire project
fr: Projet complet

source: Export as Peach Fuzzer (XML)
fr: Exporter en tant que Fuzzer Peach (XML)

source: Are you sure to override the file '{0}'?
fr: Êtes-vous sur de remplacer le fichire '{0}' ?

source: The project has been correctly exported as a Peach Fuzzer to '{0}'. Do not forget to copy in the targeted directory our Peach plugin netzob_plugins/Exporters/PeachExporter/PeachzobAddons.py.
fr: Le projet a été correctement exporté en tant que Fuzzer Peach '{0}'. Pour l'utilisez, n'oubliez pas de récupérer le fichier d'extension 'netzob_plugins/Exporters/PeachExporter/PeachzobAddons.py'.

source: The following error occurred while exporting the project as a Peach Fuzzer to '{0}': {1}
fr: L'erreur suivante est apparue lors de la tentative d'export en tant que Fuzzer Peach '{0}': {1}

source: Export project as Peach pit XML
fr: Exporter le projet au format XML Peach pit

source: Fuzzing based on:
fr: Fuzzing basé sur :

source: Mutate static fields
fr: Muter les champs statiques

source: Export
fr: Exporter

source: Provide the possibility to export netzob symbols to Peach pit files.
fr: Permet l'export sous la forme d'un fuzzer pour Peach.

source: Delete Separator
fr: Supprimer le séparateur

source: Keep Starting Separator
fr: Garder le séparateur initial

source: Keep Ending Separator
fr: Garder le séparateur final

source: Provide the possibility to import messages from any binary or ascii file.
fr: Permet l'import de messages depuis des fichiers binaire ou texte.

source: Import messages from raw file
fr: Importer des messages depuis un fichier brut

source: Contents
fr: Contenus

source: Provides the possibility to import messages from OSpy project file.
fr: Permet l'import de messages depuis le format de fichier OSpy.

source: Import messages from oSpy file
fr: Importer des messages depuis un fichier oSpy

source: Error while trying to open the file {0}.
fr: Une erreur est apparue lors de l'ouverture du fichier {0}.

source: Error while trying to open the file {0}, more permissions are required for reading it.
fr: Une erreur est apparue lors de l'ouverture du fichier {0}, les permissions ne sont pas suffisantes.

source: The provided filter is not valid (it should follow the BPF format)
fr: Le filtre proposé n'est pas valide (celui-ci doit être au format BPF)

source: This pcap cannot be imported since the layer 2 is not supported ({0})
fr: Ce PCAP ne peut être importé, car la couche protocole 2 n'est pas supportée ({0})

source: Cannot import one of the provided packets since its layer 4 is unsupported (Only UDP and TCP are currently supported, packet IP protocol number = {0})
fr: Ne peut importer l'un des paquets réseau, car sa couche protocole 4 (protocole == {0})n'est pas supportée (seuls UDP et TCP sont actuellement supportés)

source: Provide the possibility to import messages from PCAP network capture files
fr: Permet l'import de messages réseau depuis des fichiers PCAP

source: Import messages from PCAP file
fr: Importer des messages depuis un fichier PCAP

source: Provide the possibility to import messages from netzob XML message files
fr: Permet l'import de messages depuis des fichiers au format XML de Netzob

source: Import messages from XML file
fr: Importer des messages depuis un fichier XML

source: Available Plugins
fr: Plugins disponibles

source: Warning Message
fr: Message d'avertissement

source: Sorry, An uncaught exception occurred !
fr: Désolé, une exception non traitée est apparue !

source: To get your API Key, please register yourself on https://dev.net
fr: Pour obtenir votre clé d'API, vous devez être inscrit sur https://dev.netzob.org et récupérer la valeur sur la page https://dev.netzob.org/my/account

source: API Key
fr: Clé d'API

source: A bug report has been generated and is very important to us, please allow its sending. Only Netzob related informations are included in the generated bug report. Thank you for your help.
fr: Un rapport de bug a été généré et pourrait être très utile à l'équipe de développement, veuillez autoriser son envoi au serveur de Netzob. Seules les informations spécifiques à cette erreur seront transmises. Merci pour votre contribution.

source: Target
fr: Cible

source: remember API Key
fr: Mémoriser la clé d'API

source: Warning, the remote server's certificate is not valid !
fr: Attention, le certificat du serveur distant n'est pas valide !

source: Remote certificate
fr: Certificat du serveur distant

source: Do you want to continue ? (You should not unless you know what you're doing)
fr: Voulez-vous continuer ? (Vous ne devriez pas sauf si vous savez ce que vous faites)

source: Create a new symbol
fr: Créer un nouveau symbole
